app/controllers/hr/users_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 4 LIMIT 1
UPDATE `users` SET `first_name` = 'Kieran2', `updated_at` = '2018-11-23 21:08:46' WHERE `users`.`id` = 4
---
  def update
    @user = User.find(params[:id])
    @user.update(user_params)