app/controllers/requests_controller.rb

  def index
  	@requests = Request.all
---
SELECT `requests`.* FROM `requests`

  def create
  	@request = Request.new(request_params.merge(user: current_user))
  	if @request.save
---
INSERT INTO `requests` (`description`, `start`, `end`, `created_at`, `updated_at`, `user_id`, `leave_type`) VALUES ('Holiday2', '2018-11-30', '2018-12-06', '2018-11-23 21:55:27', '2018-11-23 21:55:27', 8, 1)