app/views/hr/users/show.html.erb

SELECT `requests`.* FROM `requests` WHERE `requests`.`user_id` = 4
---
    <tbody>
    <% @user.requests.each do |request| %>