app/views/layouts/application.html.erb

SELECT `requests`.* FROM `requests` WHERE `requests`.`user_id` = 4
---
          <p>Your latest leave requests:</p>
          <% current_user.requests.each do |request| %>